Repository: kiddac/ScreenNames
Catalog: ScreenNames/usr/lib/enigma2/python/Plugins/Extensions/ScreenNames/locale/*/LC_MESSAGES/ScreenNames.po
Languages: fi, it

source: plugins
fi: lisäosissa
it: Plugin

source: menu-system
fi: päävalikossa
it: Menu - Sistema

source: extensions
fi: laajennuksissa
it: Estensioni

source: Setup ScreenNames
fi: ScreenNames asetukset
it: Impostazioni ScreenNames

source: Show Skin Screen Names
fi: Näytä teeman näyttöjen nimet
it: Mostrare nomi schermate skin

source: Save
fi: Tallenna
it: Salvare

source: Cancel
fi: Peruuta
it: Annullare

source: Enable ScreenNames
fi: Ota ScreenNames käyttöön
it: Abilitare ScreenNames

source: Display plugin in
fi: Näytä lisäosa
it: Mostrare il plugin in

source: Really close without saving settings?
fi: Haluatko varmasti poistua tallentamatta asetuksia?
it: Chiudere senza salvare le impostazioni?
